{"vs/platform/environment/node/argv":["Параметры","Управление расширениями","Устранение неполадок","Сравнение двух файлов друг с другом","Добавление папок в последнее активное окно.","Открытие файла по указанному пути с выделением указанного символа в указанной строке.","Принудительно открыть новое окно.","Принудительно открыть файл или папку в уже открытом окне.","Дождаться закрытия файлов перед возвратом.","Языковой стандарт, который следует использовать (например, en-US или zh-TW).","Указывает каталог, в котором хранятся данные пользователей. Может использоваться для открытия нескольких отдельных экземпляров Code.","Печать версии.","Распечатать данные об использовании.","Отображает все события телеметрии, которые собирает VS Code.","Открывает окно с указанными URI-идентификаторами папок","Открывает окно с заданными URI файлов","Задайте корневой путь для расширений.","Перечислить существующие расширения.","Показать версии установленных расширений при указании параметра --list-extension.","Фильтрация установленных расширений по указанной категории при использовании параметра --list-extension.","Устанавливает или обновляет расширение. Используйте аргумент \"--force\", чтобы не выводить предупреждения.","Удаляет расширение.","Включает предложенные функции API для расширений. Может принимать один или несколько идентификаторов для включения отдельных расширений.","Печать подробного вывода (подразумевает использование параметра \"--wait\").","Используемый уровень ведения журнала. Значение по умолчанию — \"info\". Допустимые значения: \"critical\", \"error\", \"warn\", \"info\", \"debug\", \"trace\", \"off\".","Выводить сведения об использовании процесса и диагностическую информацию.","Запустить профилировщик ЦП при запуске","Отключить все установленные расширения.","Отключить расширение.","Разрешить отладку и профилирование расширений. Проверьте URI подключения для инструментов разработчика.","Разрешить отладку и профилирование расширений, когда узел расширения приостановлен после запуска. Проверьте URI подключения для инструментов разработчика. ","Отключить аппаратное ускорение GPU.","Максимальный размер памяти для окна (в МБ).","Использование","Параметры","пути","Чтобы прочитать вывод другой программы, добавьте '-' (например 'echo Hello World | {0} -')","Чтобы получить данные с stdin, добавьте '-' (например, 'ps aux | grep code | {0} -')\n","Неизвестная версия","Неизвестная фиксация"],"vs/platform/environment/node/argvHelper":["Неизвестный параметр \"{0}\". Выполняется пропуск.","Параметр \"{0}\" определен несколько раз. Используется значение \"{1}\".","Аргументы в режиме \"--goto\" должны быть в формате \"ФАЙЛ(:СТРОКА(:СИМВОЛ))\"."]}